In [1]:
from trino.dbapi import connect
import pandas as pd
import sqlite3
from sqlalchemy import create_engine

DB_PATH = '../escola_v2.db'

try:
    conn = sqlite3.connect(DB_PATH)
    conn.execute("PRAGMA integrity_check;")
    resultado = conn.fetchall()
    print("Resultado do integrity_check:", resultado)
except Exception as e:
    print("Erro ao abrir o banco:", e)
finally:
    conn.close()

Erro ao abrir o banco: 'sqlite3.Connection' object has no attribute 'fetchall'

In [2]:
DB_STRING_PG = 'postgresql://postgres:senha123@localhost:5432/postgres'
engine = create_engine(DB_STRING_PG)

# Conecta ao SQLite e obtém automaticamente as tabelas existentes
with sqlite3.connect(DB_PATH) as conn_sqlite:
    tabelas = pd.read_sql_query(
        "SELECT name FROM sqlite_master WHERE type='table' AND name NOT LIKE 'sqlite_%';",
        conn_sqlite
    )['name'].tolist()

    print("Tabelas encontradas no SQLite:", tabelas, "\n")

    for tabela in tabelas:
        try:
            print(f"Lendo tabela '{tabela}' do SQLite...")
            df = pd.read_sql_query(f"SELECT * FROM {tabela}", conn_sqlite)

            print(f"Gravando tabela '{tabela}' no PostgreSQL...")
            df.to_sql(
                tabela,
                engine,
                if_exists='replace',
                index=False
            )

            print(f"Tabela '{tabela}' migrada com sucesso!\n")

        except Exception as e:
            print(f"Erro ao migrar tabela '{tabela}': {e}\n")

print("Todas as tabelas processadas!")

Tabelas encontradas no SQLite: ['alunos', 'cursos', 'matriculas', 'cafes']

Lendo tabela 'alunos' do SQLite...
Gravando tabela 'alunos' no PostgreSQL...
Tabela 'alunos' migrada com sucesso!

Lendo tabela 'cursos' do SQLite...
Gravando tabela 'cursos' no PostgreSQL...
Tabela 'cursos' migrada com sucesso!

Lendo tabela 'matriculas' do SQLite...
Gravando tabela 'matriculas' no PostgreSQL...
Tabela 'matriculas' migrada com sucesso!

Lendo tabela 'cafes' do SQLite...
Gravando tabela 'cafes' no PostgreSQL...
Tabela 'cafes' migrada com sucesso!

Todas as tabelas processadas!

In [ ]:
query_alunos = "SELECT * FROM alunos"
conn = sqlite3.connect(DB_PATH)
df_alunos = pd.read_sql(query_alunos, conn)
conn.close()
df_alunos

   id_aluno           nome             email          cidade data_nascimento
0         1      Ana Silva     ana@email.com       São Paulo      1995-03-10
1         2    Bruno Souza   bruno@email.com  Rio de Janeiro      2000-01-20
2         3     Carla Diaz   carla@email.com       São Paulo      1998-07-15
3         4   Daniel Rocha  daniel@email.com  Belo Horizonte      1990-11-30
4         5  Eduardo Mello     edu@email.com        Curitiba      2002-05-10

In [ ]:
# Conectando no TRINO (Porta 8080)
conn_trino = connect(
    host='localhost',
    port=8080,
    user='postgres', # Trino não exige senha por padrão em dev
    catalog='postgresql', # O nome do arquivo .properties que criamos
    schema='public'
)

In [ ]:
from sqlalchemy import create_engine

DB_STRING_PG = 'postgresql://postgres:senha123@localhost:5432/postgres'
engine = create_engine(DB_STRING_PG)

In [ ]:
df_alunos.to_sql('alunos',
            engine,
            if_exists='replace',
            index= False
)

5

Subir cursos e matriculas

In [ ]:
query_cursos = "SELECT * FROM cursos"
conn = sqlite3.connect(DB_PATH)
df_cursos = pd.read_sql(query_cursos, conn)
conn.close()
df_cursos

   id_curso nome_curso          nivel  preco_mensal
0       101     Inglês         Básico         300.0
1       102     Inglês       Avançado         450.0
2       103   Espanhol  Intermediário         350.0
3       104    Francês         Básico         320.0

In [ ]:
df_cursos.to_sql('cursos',
            engine,
            if_exists='replace',
            index= False
)

4

In [ ]:
query_matricula = "SELECT * FROM cursos"
conn = sqlite3.connect(DB_PATH)
df_matricula = pd.read_sql(query_matricula, conn)
conn.close()
df_matricula

   id_curso nome_curso          nivel  preco_mensal
0       101     Inglês         Básico         300.0
1       102     Inglês       Avançado         450.0
2       103   Espanhol  Intermediário         350.0
3       104    Francês         Básico         320.0

In [ ]:
df_matricula.to_sql('matricula',
            engine,
            if_exists='replace',
            index= False
)

4